content/posts/Herbert_Simon's_parable_of_two_watchmakers.md
+++
title = "Herbert Simon's parable of two watchmakers"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:39-04:00
slug = "Herbert_Simon's_parable_of_two_watchmakers"
draft = false
+++

## [hierarchical modularity]({{< relref "hierarchical_modularity" >}}), [Herbert Simon]({{< relref "Herbert_Simon" >}}) {#hierarchical-modularity--hierarchical-modularity-dot-md--herbert-simon--herbert-simon-dot-md}


## <https://en.wikipedia.org/wiki/Biological%5Forganisation#Fundamentals> {#https-en-dot-wikipedia-dot-org-wiki-biological-organisation-fundamentals}


### There once were two watchmakers, named Hora and Tempus, who made very fine watches. The phones in their workshops rang frequently; new customers were constantly calling them. However, Hora prospered while Tempus became poorer and poorer. In the end, Tempus lost his shop. What was the reason behind this? {#there-once-were-two-watchmakers-named-hora-and-tempus-who-made-very-fine-watches-dot-the-phones-in-their-workshops-rang-frequently-new-customers-were-constantly-calling-them-dot-however-hora-prospered-while-tempus-became-poorer-and-poorer-dot-in-the-end-tempus-lost-his-shop-dot-what-was-the-reason-behind-this}


### The watches consisted of about 1000 parts each. The watches that Tempus made were designed such that, when he had to put down a partly assembled watch (for instance, to answer the phone), it immediately fell into pieces and had to be reassembled from the basic elements. {#the-watches-consisted-of-about-1000-parts-each-dot-the-watches-that-tempus-made-were-designed-such-that-when-he-had-to-put-down-a-partly-assembled-watch--for-instance-to-answer-the-phone--it-immediately-fell-into-pieces-and-had-to-be-reassembled-from-the-basic-elements-dot}


### Hora had designed his watches so that he could put together subassemblies of about ten components each. Ten of these subassemblies could be put together to make a larger sub-assembly. Finally, ten of the larger subassemblies constituted the whole watch. Each subassembly could be put down without falling apart. {#hora-had-designed-his-watches-so-that-he-could-put-together-subassemblies-of-about-ten-components-each-dot-ten-of-these-subassemblies-could-be-put-together-to-make-a-larger-sub-assembly-dot-finally-ten-of-the-larger-subassemblies-constituted-the-whole-watch-dot-each-subassembly-could-be-put-down-without-falling-apart-dot}
